update the readme file
